app/controllers/api/v1/netflixes_controller.rb

            def index
                @netflixes = Netflix.all
---
SELECT "netflixes".* FROM "netflixes"

            def show
                @netflix = Netflix.find(params[:id])
---
SELECT "netflixes".* FROM "netflixes" WHERE "netflixes"."id" = ? LIMIT ?  [["id", 133], ["LIMIT", 1]]

            def import_csv
                errors = []

                CSV.foreach(params[:csv].path, headers: true) do |row|
                    begin
                        Netflix.create( genre: row[1], title: row[2], director: row[3], cast: row[4],
                      country: row[5], published_at: row[6], year: row[7], rating: row[8], duration: row[9],
                      listed_in: row[10], description: row[11])
---
INSERT INTO "netflixes" ("id_csv", "genre", "title", "director", "cast", "country", "published_at", "year", "rating", "duration", "listed_in", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

            def set_netflix
                @netflix = Netflix.find(params[:id])
---
SELECT "netflixes".* FROM "netflixes" WHERE "netflixes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]